import { createApp } from 'vue'; // 导入 createApp 而不是 Vue
import Tmpl from "@/Tmpl.vue";
import 'element-plus/theme-chalk/index.css'; // Element Plus 的样式
import page11 from '@/assets/pic/page11.png'
import '@/assets/css/main.css'

const page_cfg = {
    title: "SUV联邦创业移民",
    img: page11,
    sub_title: [
        "获批速度快y週期短，无年龄限制",
        "无资产要求可同时带四个创业",
        "合伙人家庭申请移民",
    ],
    project_instruction: "加拿大创业移民旨在吸引海外高端精英人才和企业家到加拿大创办" +
        "高科技企业，创造就业，从而刺激经济增长，这将是加拿大企业家" +
        "移民制度的重大改革之一。该项目无管理经验要求，无需解释财产" +
        "来源，雅思五分，无居住地区限制。加拿大创业移民并不要求申请" +
        "人用自己的资金进行投资，只需要获得指定投资机构的支持即可，" +
        "且无论创业成功与否，申请人的永居身份都不会被取消。据统计，" +
        "未来五年，加拿大每年最",
    adapt_scope: "任何人群",
    condition: [
        "办理周期：12-18个月",
        "投资金额：无要求",
        "语言要求：雅思5分",
        "工作年限时常：2年+",
        "身份类型：永久居民",
        "学历要求：大专",
        "年龄要求：无要求",
        "管理年限要求：无要求",
    ],
    require_condition: [
        "语言CLB5及以上",
        "全日制大学专科及以上学历",
        "申请人需要有合格的业务",
        "拥有指定机构出具的承诺书和支持信",
    ],
    require_material: [
        "身份证",
        "护照",
        "照片",
        "出生证明",
        "户口本",
        "学历证书",
        "简历",
        "工作证明",
        "雅思成绩单",
        "商业计划书",
    ],
    process: [
        "递交申请加拿大境内受理中心",
        "初审通过，开始受理",
        "档案号信签发",
        "有可能要求补材料",
        "初审通过，文件转到申请人所属的境外签证办公室",
        "要求补充材料或面试",
        "体检表签发，全家去指定医院进行体检；并递交全家护照和落地签证费到签证处",
        "收到贴有落地签证的护照和落地纸，全家登陆加拿大，换取枫叶卡",
    ],
};

const app = createApp(Tmpl, page_cfg);

app.mount('#app'); // 使用 app.mount() 方法来挂载应用程序

