import { createApp } from 'vue'; // 导入 createApp 而不是 Vue
import Tmpl from "@/Tmpl.vue";
import page1 from '@/assets/pic/page1.png'
import 'element-plus/theme-chalk/index.css'; // Element Plus 的样式
import '@/assets/css/main.css'

const page_cfg = {
    title: "BC 省提名 - 技术移民",
    img: page1,
    sub_title: [
        "获批速度快、匹配时间短，成功率高",
        "无年龄要求",
        "无需资金来源证明",
    ],
    project_instruction: "不断发展的加拿大BC省对富有经验的技术专业人士的需求持续增长。技术工人类别为专业、管理、技术、贸易等技术职业领域的专才提供了在卑诗省获得永久居民身份的途径。",
    adapt_scope: "有意向在BC省定居且具有专业技术/管理工作经验的申请人。",
    condition: [
        "办理周期：8个月-12个月",
        "投资金额：无要求",
        "语言要求：雅思5分",
        "工作年限要求：2年+",
        "身份类型：永久居民",
        "学历要求：大专及以上",
        "年龄要求：无要求",
        "管理年限要求：无要求",
    ],
    advantage: [
        "BC 技术人才类移民项目是打分方式邀请申请人，BC省提名项目邀请频率高，移民成功率高。",
        "申请语言门槛较低，高级技术管理人才无硬性语言要求",
        "特殊技术人才（29类科技或指定职业类别）可通过BC 技术类省提名大幅缩短申请时间，且邀请分数门槛较低",
        "可通过联邦快速通道（EE）申请大幅提升申请速度",
        "获得BC PNP 的申请人在联邦快速通道申请中可获得600分加分",
        "获得省提名可向移民局提交工签申请或工签更新申请，等待移民期间申请人及配偶可在BC省合法工作，子女在BC省读书（入读公校学费全免，入读大学按本地生学费待遇）",
    ],
    require_condition: [
        "拥有至少两年中高级专业或管理职业经验",
        "获得BC省雇主担保支持与雇佣合同",
        "大专及以上学历",
        "语言CLB5以上（雅思G均分5/小分5）",
    ],
    require_material: [
        "过往加拿大相关入境申请资料",
        "学位学历及WES认证",
        "语言成绩单（如适用",
        "个人简历",
        "护照、照片、劳工批文（LMIA）",
    ],
    process: [
        "简历评估",
        "获得雇主担保（1-3个月）",
        "BC省提名申请",
        "收到邀请，提交材料（30个工作日内）",
        "递交工签申请（3个月内） 和联邦移民申请",
        "全家移民（特快通道6-12个月，非特快12-18个月）",
    ],
};

const app = createApp(Tmpl, page_cfg);

app.mount('#app'); // 使用 app.mount() 方法来挂载应用程序

